#!/bin/bash

# Скрипт №1
# Написати скрипт-таймер на bash, який має приймати один агрумент (число) і писати в консоль зворотній відлік. 
# Використовуйте цикли і перевірки вводу від користувача.

read -p "Введіть число секунд для зворотнього відліку: " seconds

# Перевірка, чи введене значення є цілим числом від 0 до 100 & валідація на некорректне значення
if ! [[ $seconds =~ ^[0-9]+$ ]] || [ $seconds -lt 0 ] || [ $seconds -gt 100 ]; then
  echo "Потрібно вводити тільки цифри від 0 до 100."
  echo "Помилка: Некоректне введення"
  exit 1
fi

# Зворотній відлік
for (( i=$seconds; i>=0; i-- ))
do
  echo $i
  sleep 1
done

echo "Час вийшов!"